Revit 2024 API
Family.IsEditable Property
 True if the family supports editing, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsEditable { get; }
Visual Basic
Public ReadOnly Property IsEditable As Boolean
	Get
Visual C++
public:
property bool IsEditable {
	bool get ();
}
Remarks
 The family will not be editable if it is in-place, not saveable, or represents the primary family inside a family document.
See Also
Family Class
Autodesk.Revit.DB Namespace